fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.BKM_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перебор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/BKM_СведенияОбОтпусках/BKM_СведенияОбОтпусках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BKM_СведенияОбОтпусках</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПлановаяПродолжительностьОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВКМ_СведенияОбОтпусках
	
	Движения.BKM_СведенияОбОтпусках.Записывать = Истина;

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
		|	СУММА(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДнейОтпуска) КАК ДнейОтпуска,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Перебор,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Год
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Перебор,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Год";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Перебор Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("У сотрудника %1 больше 28 отпускных дней в %2 году", Выборка.Сотрудник, Формат(Выборка.Год, "ДФ=yyyy;"));
			Сообщение.Сообщить();
			
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.BKM_СведенияОбОтпусках.Добавить();
		Движение.Период = Дата;
		Движение.Год = Выборка.Год;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ПлановаяПродолжительностьОтпуска = Выборка.ДнейОтпуска;
		
	КонецЦикла;
	
	Движения.BKM_СведенияОбОтпусках.Записать();

КонецПроцедуры

#КонецОбласти
